configuration/20201213195133-org_table.org
:PROPERTIES:
:ID:       D599C09A-16BB-4A30-BAC4-538FCD173A00
:END:
#+title: org-table

[[id:6C0A8A8F-69F8-46C0-8EEE-E93B4BC06682][org-mode]] table related utils
* how to import csv into a org table?
https://orgmode.org/manual/Built_002din-Table-Editor.html#Built_002din-Table-Editor
So just paste the data into an org file, select it, and do C-u C-c | .
 #+BEGIN_SRC untangle
 org-table-create-or-convert-from-region
 #+END_SRC





* more things


Found this code in https://www.reddit.com/r/orgmode/comments/9y52f2/i_want_to_work_on_tables_using_elisp/
#+BEGIN_SRC emacs-lisp :results silent

(defun my-table-to-lisp ()
  "This makes a list of (table_name (rest...of...properties))"
  (let ((t-name (t/org/element/name-at-point)))
    (if t-name
        (list (cons t-name (list (org-table-to-lisp)))))))

(defun t/org/all-tables-to-lisp ()
  "example output table-1  (((col1 col2) hline (va1 val2) (val3 val4)))
   pay attention in how line is called hline"
  (let ((all-tables nil))
    (org-table-map-tables
     (lambda () (setq all-tables (append all-tables (my-table-to-lisp)))))
    all-tables))

(defun t/org/insert-all-tables-to-list()
  (interactive)
  ;;(org-babel-src-block-names)
  (insert (format "|all-tables:| |\n|---|\n"  ))
  (--map (insert (format "|%s| %s|\n" (car it) (cdr it))) (t/org/all-tables-to-lisp))
  (insert "|-–|\n")
  (insert (format "|block-names:| %s|\n" (org-babel-src-block-names)) )
  (insert "|-–|\n")
  (insert (format "|result-names:| %s|\n" (org-babel-result-names)) )
  (insert "|-–|\n"))

#+END_SRC



Example of parsing 2 tables in this document

#+NAME: table-1
| col1 | col2 |
|------+------|
| va1  | val2 |
| val3 | val4 |


#+NAME: table-2
| col3 | col1 |
|------+------|
| val2 | va1  |
| val4 | val3 |


example output of =t/org/insert-table-names=

| all-tables:   |                                              |
|---------------+----------------------------------------------|
| table-1       | (((col1 col2) hline (va1 val2) (val3 val4))) |
| table-2       | (((col3 col1) hline (val2 va1) (val4 val3))) |
|---------------+----------------------------------------------|
| block-names:  | nil                                          |
|---------------+----------------------------------------------|
| result-names: | nil                                          |
|---------------+----------------------------------------------|


 #+BEGIN_SRC elisp
 (defun read-org-result-by-name (name)
   (interactive "sBuffer to rename:")
   (eval (read (format "(org-sbe %s)" name))))

 #+END_SRC

 #+RESULTS:
 : read-org-result-by-name





* Fill (auto-layout) tables


  https://github.com/casouri/ftable

  #+BEGIN_SRC untangle :results silent
  (use-package ftable
    :straight (ftable :type git :host github :repo "casouri/ftable")
    )
  #+END_SRC


* org-listtable-to-string. It's the reverse of org-table-to-lisp.

;; https://stackoverflow.com/a/22146049
;; answer from abo-abo
;; code found https://github.com/tkf/org-mode/blob/c2ebeea6f68f2ef804d387c238e4acccf655dc64/lisp/org-colview.el#L1326

#+BEGIN_SRC emacs-lisp :results silent
(defun org-listtable-to-string (tbl)
  "Convert a listtable TBL to a string that contains the Org-mode table.
The table still need to be aligned.  The resulting string has no leading
and tailing newline characters."
  (mapconcat
   (lambda (x)
     (cond
      ((listp x)
       (concat "|" (mapconcat 'identity x "|") "|"))
      ((eq x 'hline) "|-|")
      (t (error "Garbage in listtable: %s" x))))
   tbl "\n"))

#+END_SRC



* TODO aggregate org tables
https://github.com/tbanel/orgaggregate
